---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Events.PostEventArgs
source: html/5f2f2a4b-b756-30cd-cccd-db030b22ef50.htm
---
# PostEventArgs Members

Indicates whether the event is being cancelled.
When the event is cancellable, set the property to True to cancel it.